#date: 2022-09-21T17:05:24Z
#url: https://api.github.com/gists/04668fbdc02c1014cb783eec199aa98e
#owner: https://api.github.com/users/MiDemGG

##УВВ-111

##Напишите консольную программу, которая переводит значения из рублей
##в доллары по курсу 68.33.

print('Введите кол-во рублей')
rub = int(input())
print('долларов', rub * 68.33)
