#date: 2023-03-23T17:07:08Z
#url: https://api.github.com/gists/2cf0200d3d45bf0f1301db365fc038b1
#owner: https://api.github.com/users/t0023656

print('''

         ."'=-,     ,.,.,_
        (_____ )."=`      `"=,
       ./_ _  \`\             `;..
      / (o(o) |\=\              ; `;
     (_/|     | \ |             ;`"`
        |     |  `             ;
        \ ..  /`,_          _.'
         `---'   `#"#""'"#'#^
                  # #    # #
                  # #    # #
                  # #    # #
                  # #    # #
                  # #    # #
            jgs  /#|#\  /#|#\\
                 `"`"`  `"`"`

''')
print("歡迎來到金銀島。\n")
print("你的任務是找到島上的寶物。\n")
print("你走到了一個路口，看到路旁的牌子上寫著~ \n")
print("左：通往夢幻池。\n")
print("右：通往無盡山。\n")

chose = input("向左(l)還是向右(r): ")
if chose == 'l' or chose == 'L':
    print("你決定前往夢幻池，一路上風光明媚，經過了一段時間，終於到了抵達了銀光閃閃的夢幻池。\n")
    print("面對著前面的池水，你正考慮著是否馬上游泳渡水？\n")
    chose = input("游泳(s)或是停留一下(w): ")
    if chose == 'w' or chose == 'W':
        print("你四處看看，發現旁邊有塊平台可以暫時棲身休息。\n")
        print("當你稍作休息時，天上原本的烏雲突然散去。\n")
        print("此時一道月光灑下，你的面前出現了紅、黃、藍三道門。")
        print("一個聲音從你的耳邊劃過，'選擇一道門進入，將會獲得無上至寶。' \n")
        chose = input("你選擇 紅(r) 黃(y) 藍(b) 哪道門進入：")
        if chose == 'y' or chose == 'Y':
            print("當你打開黃色之門，數百到金光由裡向外投射了出來。\n")
            print("你朝著深處最明亮的地方走去，伸手觸碰高台上的亮光。\n")
            print("一道閃光環繞著你，你的手上出現了一個黃金頭盔。\n")
            print("恭喜你，獲得了'閃亮亮黃金頭盔'。\n")
            print("感謝你參與這一段微冒險。遊戲結束。\n")
        elif chose == 'r' or chose == 'R':
            print("熊熊的火焰吞噬了你～\n")
            print("你在旅途中不幸受傷。遊戲結束。\n")
        elif chose == 'b' or chose == 'B':
            print("一頭凶猛的巨齒獸，飛撲了過來～\n")
            print("你在旅途中不幸受傷。遊戲結束。\n")
        else:
            print("三道門已消失，你錯過了開啟正確之門的時間了。\n")
            print("在接下來的時間裡，只有無盡的等待與徘徊。遊戲結束。\n")
    else:
        print("～～～阿，遇到半漁人的偷襲。")
        print("你在旅途中不幸受傷。遊戲結束。")
else:
    print("喔喔，你掉入了一個陷阱。")
    print("你在旅途中不幸受傷。遊戲結束。")
